PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_ecdsa.c
/***************************************************************************//**
* \file cy_crypto_core_ecc_ecdsa.c
* \version 2.150
*
* \brief
*  This file provides constant and parameters for the API for the ECC ECDSA
*  in the Crypto driver.
*
********************************************************************************
* \copyright
* Copyright (c) (2020-2024), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXCRYPTO)

#include "cy_crypto_core_ecc.h"

#if defined(__cplusplus)
extern "C" {
#endif

#if defined(CY_CRYPTO_CFG_ECDSA_C)

#include "cy_crypto_core_ecc_nist_p.h"
#include "cy_crypto_core_mem.h"
#include "cy_crypto_core_vu.h"

#if defined(CY_CRYPTO_CFG_ECDSA_SIGN_C)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_ECC_SignHash
****************************************************************************//**
*
* Sign a message digest.
*
* When D-Cache is enabled parameters hash, sign, messageKey and key( k, x&y of pubkey) must align and end in 32 byte boundary.
*
* \param base
* The pointer to a Crypto instance.
*
* \param hash
* The message digest to sign. Provided as is in data buffer.
*
* \param hashlen
* The length of the digest in bytes.
*
* \param sig
* [out] The destination for the signature, 'r' followed by 's'.
*
* \param key
* Key used for signature generation. See \ref cy_stc_crypto_ecc_key.
*
* \param messageKey
* Message key.
*
* \return status code. See \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ECC_SignHash(CRYPTO_Type *base, const uint8_t *hash, uint32_t hashlen, uint8_t *sig,
        const cy_stc_crypto_ecc_key *key, const uint8_t *messageKey)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    cy_stc_crypto_ecc_key ephKey;

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    uint8_t myKGX_t[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_ECC_MAX_BYTE_SIZE) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
    uint8_t myKGY_t[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_ECC_MAX_BYTE_SIZE) + CY_CRYPTO_DCAHCE_PADDING_SIZE];
    uint8_t *myKGX = (uint8_t *)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(myKGX_t);
    uint8_t *myKGY = (uint8_t *)CY_CRYPTO_DCACHE_ALIGN_ADDRESS(myKGY_t);
#else
    uint8_t myKGX[CY_CRYPTO_ECC_MAX_BYTE_SIZE];
    uint8_t myKGY[CY_CRYPTO_ECC_MAX_BYTE_SIZE];
#endif

    uint8_t *sigPtrRemap;
    uint8_t *hashPtrRemap;
    uint8_t *keyKRemap;
    uint8_t *messageKeyPtrRemap;


    const cy_stc_crypto_ecc_dp_type *eccDp;
    uint32_t mallocMask = 0U;


    /* NULL parameters checking */
    if ((hash != NULL) && (0u != hashlen) && (sig != NULL) && (key != NULL) && (messageKey != NULL))
    {
        tmpResult = CY_CRYPTO_NOT_SUPPORTED;

        hashPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hash);
        sigPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(sig);
        messageKeyPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(messageKey);
        keyKRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(key->k);

        eccDp = Cy_Crypto_Core_ECC_GetCurveParams(key->curveID);

        if (eccDp != NULL)
        {
            uint32_t bitsize  = eccDp->size;
            uint32_t bytesize = CY_CRYPTO_BYTE_SIZE_OF_BITS(eccDp->size);
            uint32_t datasize = hashlen;

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
            /* Flush the cache */
            SCB_CleanDCache_by_Addr((volatile void *)hash, (int32_t)hashlen);
            SCB_CleanDCache_by_Addr((volatile void *)key->k, (int32_t)bytesize);
            SCB_CleanDCache_by_Addr((volatile void *)messageKey, (int32_t)bytesize);
#endif

            /* make ephemeral key pair */
            ephKey.pubkey.x = CY_REMAP_ADDRESS_FOR_CRYPTO(myKGX);
            ephKey.pubkey.y = CY_REMAP_ADDRESS_FOR_CRYPTO(myKGY);

            tmpResult = Cy_Crypto_Core_ECC_MakePublicKey(base, key->curveID, messageKeyPtrRemap, &ephKey);

            if (CY_CRYPTO_SUCCESS == tmpResult)
            {
                uint32_t dividend =  0U;   /* for whatever reason Crypto_EC_DivMod only works if dividend is in register 0 */
                uint32_t p_temp   =  8U;
                uint32_t p_r      =  9U;
                uint32_t p_s      = 10U;
                uint32_t p_d      = 11U;
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
                /* Flush the cache */
                SCB_CleanDCache_by_Addr((volatile void *)ephKey.pubkey.x, (int32_t)bytesize);
                SCB_CleanDCache_by_Addr((volatile void *)ephKey.pubkey.y, (int32_t)bytesize);
#endif
                /* load values needed for reduction modulo order of the base point */
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_P, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                Cy_Crypto_Core_Vu_SetMemValue(base, VR_P, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(eccDp->order), bitsize);

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_BARRETT, bitsize + 1U);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                Cy_Crypto_Core_Vu_SetMemValue(base, VR_BARRETT, (uint8_t const*)CY_REMAP_ADDRESS_FOR_CRYPTO(eccDp->barrett_o), bitsize);

