PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_ecdsa.c
    const cy_stc_crypto_ecc_dp_type *eccDp;

    uint32_t mallocMask = 0U;
    bool isHashZero = false;

    uint8_t *sigPtrRemap;
    uint8_t *hashPtrRemap;
    uint8_t *pubKeyXRemap;
    uint8_t *pubKeyYRemap;

    /* NULL parameters checking */
    if ((sig != NULL) && (hash != NULL) && (0u != hashlen) && (stat != NULL) && (key != NULL))
    {
        tmpResult = CY_CRYPTO_NOT_SUPPORTED;

        hashPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hash);
        sigPtrRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(sig);
        pubKeyXRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(key->pubkey.x);
        pubKeyYRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(key->pubkey.y);

        eccDp = Cy_Crypto_Core_ECC_GetCurveParams(key->curveID);

        if (eccDp != NULL)
        {
            uint32_t bitsize  = eccDp->size;
            uint32_t bytesize = CY_CRYPTO_BYTE_SIZE_OF_BITS(eccDp->size);
            uint32_t datasize = hashlen;

            uint32_t dividend = 0u;   /* for whatever reason Crypto_EC_DivMod only works if dividend is in register 0 */
            uint32_t p_r  = 4U;
            uint32_t p_s  = 5U;
            uint32_t p_u1 = 6U;
            uint32_t p_u2 = 7U;
            uint32_t p_o  = 8U;
            uint32_t p_gx = 9U;
            uint32_t p_gy = 10U;
            uint32_t p_qx = 11U;
            uint32_t p_qy = 12U;
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
            /* Flush the cache */
            SCB_CleanDCache_by_Addr((volatile void *)hash, (int32_t)hashlen);
            SCB_CleanDCache_by_Addr((volatile void *)key->pubkey.x, (int32_t)bytesize);
            SCB_CleanDCache_by_Addr((volatile void *)key->pubkey.y, (int32_t)bytesize);
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to int32_t.');
            SCB_CleanDCache_by_Addr((volatile void *)sig, (int32_t)(2u * bytesize));
            SCB_CleanDCache_by_Addr((volatile void *)eccDp->order, (int32_t)bytesize);
            SCB_CleanDCache_by_Addr((volatile void *)eccDp->Gx, (int32_t)bytesize);
            SCB_CleanDCache_by_Addr((volatile void *)eccDp->Gy, (int32_t)bytesize);
            SCB_CleanDCache_by_Addr((volatile void *)eccDp->prime, (int32_t)bytesize);
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to int32_t.');
            SCB_CleanDCache_by_Addr((volatile void *)eccDp->barrett_o, (int32_t)(bytesize + 1u));
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to int32_t.');
            SCB_CleanDCache_by_Addr((volatile void *)eccDp->barrett_p, (int32_t)(bytesize + 1u));
#endif
            /* use Barrett reduction algorithm for operations modulo n (order of the base point) */
            Cy_Crypto_Core_EC_NistP_SetRedAlg(CY_CRYPTO_NIST_P_BARRETT_RED_ALG);
            Cy_Crypto_Core_EC_NistP_SetMode(bitsize);

            /*******************************************************************************/
            /* load values needed for reduction modulo order of the base point             */
            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_P, bitsize);
            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
            Cy_Crypto_Core_Vu_SetMemValue(base, VR_P, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(eccDp->order), bitsize);

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_BARRETT, bitsize + 1U);
            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
            Cy_Crypto_Core_Vu_SetMemValue(base, VR_BARRETT, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(eccDp->barrett_o), bitsize + 1U);

            /*******************************************************************************/
            /* check that R and S are within the valid range, i.e. 0 < R < n and 0 < S < n */
            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_r, bitsize);
            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_s, bitsize);
            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            Cy_Crypto_Core_Vu_SetMemValue(base, p_r, (uint8_t *)sigPtrRemap, bitsize);
            Cy_Crypto_Core_Vu_SetMemValue(base, p_s, (uint8_t *)&sigPtrRemap[bytesize], bitsize);

            mallocMask = CY_CRYPTO_VU_REG_BIT(VR_P) | CY_CRYPTO_VU_REG_BIT(VR_BARRETT) |
                         CY_CRYPTO_VU_REG_BIT(p_r)  | CY_CRYPTO_VU_REG_BIT(p_s);

            /* Check R and S range */
            if (Cy_Crypto_Core_Vu_IsRegZero(base, p_r))
            {
                /* R is zero!!! */
                tmpResult = CY_CRYPTO_BAD_PARAMS;
            }
            if (!Cy_Crypto_Core_Vu_IsRegLess(base, p_r, VR_P))
            {
                /* R is not less than n!!! */
                tmpResult = CY_CRYPTO_BAD_PARAMS;
            }
            if (Cy_Crypto_Core_Vu_IsRegZero(base, p_s))
            {
                /* S is zero!!! */
                tmpResult = CY_CRYPTO_BAD_PARAMS;
            }
            if (!Cy_Crypto_Core_Vu_IsRegLess(base, p_s, VR_P))
            {
                /* S is not less than n!!! */
                tmpResult = CY_CRYPTO_BAD_PARAMS;
            }

            if (CY_CRYPTO_SUCCESS == tmpResult)
            {
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_u1, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_u2, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_gx, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_gy, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_qx, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_qy, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                mallocMask |= CY_CRYPTO_VU_REG_BIT(dividend) |
                              CY_CRYPTO_VU_REG_BIT(p_u1) | CY_CRYPTO_VU_REG_BIT(p_u2) |
                              CY_CRYPTO_VU_REG_BIT(p_gx) | CY_CRYPTO_VU_REG_BIT(p_gy) |
                              CY_CRYPTO_VU_REG_BIT(p_qx) | CY_CRYPTO_VU_REG_BIT(p_qy);

                /* load message hash, truncate it if needed */
                CY_CRYPTO_VU_SET_TO_ZERO(base, p_u1);

