PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_ecdsa.c
                /* load message hash, truncate it if needed. */
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_o,  datasize * 8u);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                CY_CRYPTO_VU_SET_TO_ZERO(base, p_o);
                Cy_Crypto_Core_Vu_SetMemValue(base, p_o, (uint8_t *)hashPtrRemap, datasize * 8u);
                Cy_Crypto_Core_VU_RegInvertEndianness(base, p_o);

                /* Check if message hash is zero */
                if (Cy_Crypto_Core_Vu_IsRegZero(base, p_o))
                {
                    isHashZero = true;
                }

                if ((datasize * 8u) > bitsize)
                {
                    CY_CRYPTO_VU_SET_REG(base, dividend, (datasize * 8u) - bitsize, 1u);
                    CY_CRYPTO_VU_LSR(base, p_o, p_o, dividend);
                }

                /* Use p_o as temporary register */
                CY_CRYPTO_VU_MOV(base, p_u1, p_o);

                CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(p_o));
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, p_o, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, dividend, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                /* check that the prepared hash value is smaller than the order of base point */
                if (!Cy_Crypto_Core_Vu_IsRegLess(base, p_u1, VR_P))
                {
                    /* Use p_o as temporary register */
                    CY_CRYPTO_VU_MOV(base, p_o, p_u1);
                    Cy_Crypto_Core_Vu_WaitForComplete(base);

                    /* z = x % mod */
                    tmpResult = Cy_Crypto_Core_EC_Bar_MulRed(base, p_u1, p_o, bitsize);
                    if (CY_CRYPTO_SUCCESS != tmpResult)
                    {
                        return tmpResult;
                    }
                }

                /* w = s^-1 mod n */
                CY_CRYPTO_VU_SET_TO_ONE(base, dividend);
                tmpResult = Cy_Crypto_Core_EC_DivMod(base, p_s, dividend, p_s, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                /* u1 = e*w mod n */
                tmpResult = Cy_Crypto_Core_EC_MulMod(base, p_u1, p_u1, p_s, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                /* u2 = r*w mod n */
                tmpResult = Cy_Crypto_Core_EC_MulMod(base, p_u2, p_r, p_s, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                /* Initialize point multiplication */
                Cy_Crypto_Core_EC_NistP_SetRedAlg(eccDp->algo);

                /* load prime, order and Barrett coefficient */
                Cy_Crypto_Core_Vu_SetMemValue(base, VR_P, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(eccDp->prime), bitsize);
                Cy_Crypto_Core_Vu_SetMemValue(base, VR_BARRETT, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(eccDp->barrett_p), bitsize + 1U);

                /* load base Point G */
                Cy_Crypto_Core_Vu_SetMemValue(base, p_gx, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(eccDp->Gx), bitsize);
                Cy_Crypto_Core_Vu_SetMemValue(base, p_gy, (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(eccDp->Gy), bitsize);

                /* load public key Qa */
                Cy_Crypto_Core_Vu_SetMemValue(base, p_qx, (uint8_t const *)pubKeyXRemap, bitsize);
                Cy_Crypto_Core_Vu_SetMemValue(base, p_qy, (uint8_t const *)pubKeyYRemap, bitsize);

                /* u1 * G */
                tmpResult = Cy_Crypto_Core_EC_NistP_PointMul(base, p_gx, p_gy, p_u1, p_o, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                /* u2 * Qa */
                tmpResult = Cy_Crypto_Core_EC_NistP_PointMul(base, p_qx, p_qy, p_u2, p_o, bitsize);
                if (CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                if (isHashZero)
                {
                    /* GECC 3.22 */
                    CY_CRYPTO_VU_MOV(base, p_s, p_qx);
                }
                else
                {
                    /* P = u1 * G + u2 * Qa. Only Px is needed */
                    Cy_Crypto_Core_EC_SubMod(base, dividend, p_qy, p_gy);            /* (y2-y1) */
                    Cy_Crypto_Core_EC_SubMod(base, p_s, p_qx, p_gx);                /* (x2-x1) */
                    tmpResult = Cy_Crypto_Core_EC_DivMod(base, p_s, dividend, p_s, bitsize);    /* s = (y2-y1)/(x2-x1) */
                    if (CY_CRYPTO_SUCCESS != tmpResult)
                    {
                        return tmpResult;
                    }

                    tmpResult = Cy_Crypto_Core_EC_SquareMod(base, p_s, p_s, bitsize);            /* s^2 */
                    if (CY_CRYPTO_SUCCESS != tmpResult)
                    {
                        return tmpResult;
                    }
                    Cy_Crypto_Core_EC_SubMod(base, p_s, p_s, p_gx);                /* s^2 - x1 */
                    Cy_Crypto_Core_EC_SubMod(base, p_s, p_s, p_qx);                /* s^2 - x1 - x2 which is Px mod n */
                }

                CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(p_o));

                if (Cy_Crypto_Core_Vu_IsRegEqual(base, p_s, p_r))
                {
                    *stat = 1u;
                }
                else
                {
                    *stat = 0u;
                }
            }

            CY_CRYPTO_VU_FREE_MEM(base, mallocMask);
        }
    }

    return (tmpResult);
}
#endif /* defined(CY_CRYPTO_CFG_ECDSA_VERIFY_C) */

#endif /* defined(CY_CRYPTO_CFG_ECDSA_C) */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXCRYPTO */


/* [] END OF FILE */
